Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: བདག་བུ་གུམ་མམ་གསོན་ཞིག་ཅེས། །ཞུམ་པའི་ཡིད་ཀྱིས་འདྲི་བར་བྱེད། །
en: She asked with a despairing mind, “Are my sons alive or dead?”

source: རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་ཡིས། །བཙུན་མོ་མཆོག་ལ་འདི་སྐད་སྨྲས། །བློན་པོ་དག་དང་འཁོར་རྣམས་ཀྱང་། །གཞོན་ནུ་རྣམས་ནི་ཚོལ་ཕྱིར་དོང་། །
en: “ ‘King Mahāratha said To his principal queen, “The ministers and the court Have gone in search of the boys.

source: ཁྱོད་ནི་རབ་ཏུ་ཡིད་ཞུམ་ཞིང་། །རྟག་ཏུ་མྱ་ངན་སྙིང་མ་བྱེད། །
en: “ ‘ “Do not let your mind be in deep despair And have continuous misery in your heart.”

source: དེ་ལྟར་ཤིང་རྟ་ཆེན་པོ་ཡིས། །བཙུན་མོ་དམ་པ་སྤྲོ་བསྲིངས་ཏེ། །
en: Speaking in that way, Mahāratha Comforted the principal queen.

source: རྒྱལ་པོའི་ཕོ་བྲང་ནས་བྱུང་ནས། །མྱ་ངན་ནོན་ཅིང་ངུ་བཞིན་དུ། །བློན་པོའི་ཚོགས་ཀྱིས་ཡོངས་བསྐོར་ཏེ། །ཡིད་ནི་རབ་ཞུམ་ལུས་ཀྱང་ཞན། །
en: “ ‘The king came out of the palace Oppressed by misery and weeping, Accompanied by his ministers, In despair, his body weakened.

source: སྲོག་ཆགས་བརྒྱ་ཕྲག་མང་པོ་ཡང་། །ངུ་ཞིང་མཆི་མ་ཟག་བཞིན་རྒྱུག །རྒྱལ་བུ་རྣམས་ནི་བཙལ་བའི་ཕྱིར། །གྲོང་ཁྱེར་གྱི་ནི་མཆོག་ནས་བྱུང་། །
en: “ ‘Also, many hundreds of people, Running, weeping, with tears streaming, Were coming out of the greatest of cities In order to search for the princes.

source: རྒྱལ་པོ་བྱུང་བ་མཐོང་ནས་ནི། །རྒྱལ་པོའི་ཕྱི་བཞིན་ཀུན་ཏུ་འབྲང་། །
en: “ ‘When they saw the king departing, They all followed after the king.

source: རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་ནི། །གྲོང་ཁྱེར་ནས་བྱུང་དེ་མ་ཐག །སྡུག་པའི་བུ་ནི་བལྟ་བའི་ཕྱིར། །རྒོད་པའི་མིག་གིས་ཕྱོགས་སུ་བལྟས། །
en: When King Mahāratha came out Of the city, he immediately “ ‘Looked around with wild eyes, Seeking for his beloved sons.

source: མགོ་བྲེགས་ཡན་ལག་ཁྲག་སྦགས་ཤིང་། །ལུས་ལ་རྡུལ་གྱིས་གོས་གྱུར་ལ། །གདོང་ལ་མཆི་ཟག་ངུ་བཞིན་དུ། །འོང་བའི་མི་ཞིག་མཐོང་ནས་ནི། །
en: He saw a man approaching With head shaved and bloody hands, “ ‘His body stained with dirt, weeping, With tears streaming down his face.

source: ཤིང་རྟ་ཆེན་པོའི་སྙིང་ལ་ཡང་། །རབ་ཏུ་མི་བཟད་མྱ་ངན་གནས། །
en: Then there was an unendurable misery Within the heart of Mahāratha.

source: ངུ་ཞིང་གདོང་ལ་མཆི་མ་ཟག །
en: “ ‘He wept, tears running down his face.

source: ལག་པ་བསྒྲེང་སྟེ་ངུ་ཞིང་འདུག །
en: Standing with arms outstretched, he wept.

source: དེ་ནས་བློན་པོ་གཞན་ཞིག་ནི། །རྒྱང་རིང་མྱུར་དུ་རིངས་པར་འོང་། །
en: Then another minister came quickly, Hurriedly, from the far distance.

source: འོངས་ནས་མི་དབང་རྒྱལ་པོ་ནི། །ཤིང་རྟ་ཆེ་ལ་འདི་སྐད་སྨྲས། །མི་དབང་ཐུགས་ངན་མ་མཛད་ཅིག །ཁྱོད་སྲས་ཡིད་དུ་འོང་བ་མཆིས། །
en: “ ‘When he arrived, he said to the king, The lord of men, Mahāratha, “My lord, do not be sad, Your beloved sons are alive.

source: རིང་པོར་མི་ཐོགས་ཁྱོད་ཀྱི་གནས་འདིར་ནི། །སྲས་མཆོག་ཡིད་འོང་མཆི་བ་ཁྱོད་ཀྱིས་གཟིགས། །
en: “ ‘ “Before long they will be here with you, And you will see your beloved, excellent sons!”

source: རྒྱལ་པོ་ཡུད་ཙམ་ལམ་དུ་ཞུགས་པ་དང་། །དེ་ནས་བློན་པོ་ཆེན་པོ་གཉིས་པ་འོངས། །
en: The king in a moment set out on the road, And then two prime ministers came.

source: རྡུལ་ཆགས་དྲི་མ་ཅན་གྱི་གོས་གྱོན་ཅིང་། །མཆི་མའི་གདོང་གིས་རྒྱལ་ལ་འདི་སྐད་སྨྲས། །རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱི་སྲས་གཉིས་ནི། །མྱ་ངན་མེ་ཡིས་རབ་ཏུ་གདུངས་ཤིང་གནས། །
en: “ ‘Their clothes were dirty and stained And with tears on their faces they said to the king, “Great King, two of your sons are alive But burning from the fire of misery.

source: རྒྱལ་པོ་ཁྱོད་ཀྱི་སྲས་མཆོག་གཅིག་མི་གདའ། །སྙིང་སྟོབས་ཆེན་པོ་མི་རྟག་ཉིད་ཀྱིས་ཟིན། །
en: “ ‘ “King, one of your excellent sons is missing; Mahāsattva has been seized by impermanence.

source: སྟག་མོ་བུ་བྱུང་རིང་པོར་མ་ལོན་པ། །རང་གི་བུ་རྣམས་ཟ་བར་འདོད་པ་མཐོང་། །
en: He saw a tigress that had recently given birth And she was desiring to eat her own cubs.

source: དེ་དག་ལ་ནི་གཞོན་ནུ་སེམས་ཅན་ཆེས། །སྙིང་རྗེ་ཆེན་པོ་ལྡན་པས་སེམས་བསྐྱེད་ནས། །
en: “ ‘ “The youth Mahāsattva had for them A motivation of great compassion.

source: བྱང་ཆུབ་ཏུ་ནི་སྨོན་ལམ་ཆེ་བཏབ་པ། །སེམས་ཅན་ཐམས་ཅད་བདག་གིས་དགྲོལ་བར་བྱ། །
en: He made a great prayer for enlightenment, Saying, ‘I am going to liberate all beings!

source: བྱང་ཆུབ་ཟབ་མོ་རྒྱ་ཆེན་འདོད་པ་ལ། །མ་འོངས་དུས་ན་བདག་གིས་རིག་པར་བྱ། །
en: “ ‘ “ ‘May I in the future reach that vast, Profound enlightenment that I long for!’

source: སེམས་ཅན་ཆེན་པོ་རི་ངོས་གཟར་ནས་མཆོངས། །སྟག་མོ་བཀྲེས་པས་ནོན་པ་དེ་ལངས་ཏེ། །
en: Mahāsattva leapt from a mountain cliff And was taken by the tigress tormented by hunger.

source: ཡུད་ཙམ་གྱིས་ནི་ལུས་ལ་ཤ་མེད་བྱས། །རྒྱལ་པོའི་བུ་ནི་རུས་པ་ཉི་ཙེ་ལུས། །
en: “ ‘ “In a brief time his body had no flesh; Soon only the bones of the prince remained.”

source: མ་རུངས་པ་ཡི་ཚིག་ནི་དེ་ཐོས་ནས། །རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་བརྒྱལ་གྱུར་ཏེ། །
en: King Mahāratha fell into a faint When he heard these dreadful words.

source: ས་ལ་འགྱེལ་ནས་སེམས་ཀྱང་སྟོར་བར་གྱུར། །མྱ་ངན་མེ་ནི་ཤིན་ཏུ་མི་བཟད་འབར། །
en: “ ‘He fell to the ground and lost consciousness, Burned by the unendurable fire of grief.

source: འཁོར་དང་བློན་པོས་སྙིང་རྗེའི་སྐད་ཀྱིས་ནི། །ངུ་ཞིང་མྱ་ངན་ནོན་བཞིན་དེ་དག་ཀྱང་། །ཆུས་གཏོང་ལག་པ་བསྒྲེང་སྟེ་རབ་ཏུ་ངུ་། །
en: His court and the ministers with piteous cries wept, And though oppressed by misery, “ ‘They sprinkled water on him, weeping with upraised arms.

source: བློན་པོ་གསུམ་པས་རྒྱལ་ལ་སྨྲས་པ་ནི། །བདག་གིས་དེ་རིང་གཞོན་ནུ་གཉིས་པོ་དག །ནགས་ཆེན་དེ་ན་རབ་ཏུ་བརྒྱལ་གྱུར་ཞིང་། །ས་ལ་འགྱེལ་ཏེ་སེམས་ཀྱང་སྟོར་མཐོང་ནས། །
en: A third minister said to the king, “Today I saw that the two princes Had fainted in that great forest.

source: དྲན་པ་རྙེད་དེ་ལངས་ཀྱི་བར་དུ་ནི། །བདག་ཅག་རྣམས་ཀྱིས་ཆབ་ཀྱིས་རབ་ཏུ་གཏོར། །
en: “ ‘ “They were lying on the ground, unconscious, And we sprinkled water upon them Until they recovered and stood up.

source: ཕྱོགས་བཞི་དག་ན་ཀུན་ནས་འབར་བར་མཐོང་། །ཡུད་ཙམ་འགྲེང་ནས་སླར་ཡང་ས་ལ་འགྱེལ། །
en: Ablaze, they looked into the four directions, “ ‘ “And after briefly standing they again fell to the ground.

source: སྙིང་རྗེའི་སྐད་ཀྱིས་སྨྲེ་སྔགས་རབ་ཏུ་འདོན། །རྟག་པར་ལག་པ་བསྒྲེང་སྟེ་གནས་ནས་ནི། །ནུ་བོ་དེ་ཡི་བསྔགས་པ་རབ་ཏུ་བརྗོད། །
en: With piteous cries they emitted wails, Their arms constantly upraised and in despair, And spoke in praise of their younger brother.”

source: རྒྱལ་པོ་དེ་ནི་རབ་ཏུ་སེམས་ཞུམ་ཞིང་། །བུ་དང་བྲལ་བས་ནོན་ནས་སེམས་ཀྱང་འཁྲུགས། །མྱ་ངན་རབ་ཏུ་གདུངས་ཤིང་སྨྲེ་སྔགས་འདོན། །
en: “ ‘The king was in complete despair; In grief from the loss of his son, his mind was in disarray.

source: རྒྱལ་པོ་དེ་ནི་འདི་སྙམ་ཡོངས་སུ་སེམས། །བདག་བུ་སྡུག་ཅིང་ཡིད་འོང་གཅིག་པོ་ནི། །སེམས་ཅན་ཆེན་པོ་མི་རྟག་ཉིད་ཀྱིས་ཟིན། །བདག་གི་བུ་ནི་གཉིས་པོ་དེ་དག་ཀྱང་། །མྱ་ངན་མེ་ཡིས་སྲོག་ནི་ཟད་འོང་གིས། །
en: Tormented by his grief he emitted wails, And in his mind the king had this thought: “ ‘ “I have one beloved, beautiful son, Mahāsattva, who has been seized by impermanence, And the other two sons of mine Will lose their lives to the fire of grief.

source: འདི་ལྟར་བདག་ནི་མྱུར་དུ་དེར་སོང་ལ། །མཐོང་ན་དགའ་བའི་བུ་དག་བལྟ་བར་བྱ། །
en: “ ‘ “Therefore, I must quickly go there To see my two beloved sons.

source: བཞོན་པ་མགྱོགས་པས་རྒྱལ་པོའི་ཕོ་བྲང་གི །རྒྱལ་པོའི་ཁབ་ཏུ་མྱུར་དུ་བཀྲི་བར་བྱ། །
en: Then I will quickly bring the princes To the royal capital and into the royal palace.

source: དེ་དག་རྣམས་ནི་སྐྱེད་པའི་མ་ཡི་སྙིང་། །མྱ་ངན་མེ་ཡིས་གས་པར་འགྱུར་དུ་འོང་། །
en: “ ‘ “The heart of their mother, who gave them birth, May break because of the fire of her grief.

source: བུ་གཉིས་མཐོང་ནས་ཞི་བ་ཐོབ་འགྱུར་ཏེ། །སྲོག་དང་བྲལ་བར་འགྱུར་བ་མ་ཡིན་ནོ། །
en: She will attain peace from seeing her two sons And then she will not lose her life.”

source: རྒྱལ་པོ་བློན་པོའི་ཚོགས་ཀྱིས་ཡོངས་བསྐོར་ནས། །གླང་ཆེན་ཞོན་ཏེ་བུ་རྣམས་བལྟ་ཕྱིར་སོང་། །
en: “ ‘The king, accompanied by his ministers, Riding an elephant, went to see that place.

source: བུ་གཉིས་སྙིང་རྗེའི་སྐད་ཀྱིས་རབ་ངུ་ཞིང་། །ནུ་བོའི་མིང་འབོད་ལམ་ནས་འོང་བ་མཐོང་། །
en: He saw his two sons coming along the road, weeping, With pitiful cries calling the name of their younger brother.

source: རྒྱལ་པོས་བུ་དེ་གཉིས་ནི་ཁྲིད་ནས་སུ། །རབ་ཏུ་ངུ་ཞིང་ཁྱིམ་དུ་སོང་ནས་ནི། །
en: “ ‘The king collected those two sons; Weeping, they went to their home.

source: དེ་ཡིས་སྐྱེན་པར་ལ་གོར་མྱུར་དུ་ཡང་། །བཙུན་མོ་ལ་ནི་རང་གི་བུ་རྣམས་བསྟན། །
en: In that way he was able to quickly, speedily Show the queen her own two sons.

source: ཤཱཀྱ་ཐུབ་པ་དེ་བཞིན་གཤེགས་པ་ང་། །སྔོན་གྱི་རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་ཡི། །བུ་སྟེ་སྙིང་སྟོབས་ཆེན་པོ་མཆོག་གྱུར་ཅིང་། །གང་གིས་སྟག་མོ་བདེ་བར་བྱས་པ་ཡིན། །
en: “ ‘In the past, I, Śākyamuni, the Tathāgata, Was that excellent Mahāsattva, Who was the son of King Mahāratha That brought happiness to the tigress.

source: རྒྱལ་པོའི་དབང་པོ་དམ་པ་ཟས་གཙང་ནི། །ཤིང་རྟ་ཆེ་ཞེས་བྱ་བའི་རྒྱལ་པོར་གྱུར། །
en: “ ‘The excellent lord of kings, Śuddhodana, Was the king who was named Mahāratha.

source: བཙུན་མོའང་བཙུན་མོ་དམ་པ་སྒྱུ་འཕྲུལ་གྱུར། །
en: The queen was the excellent Queen Māyā.

source: སྒྲ་ཆེན་པོ་ནི་བྱམས་པར་གྱུར་པ་ཡིན། །
en: Mahāpraṇāda was Maitreya.

source: རྒྱལ་བུ་ལྷ་ཆེན་པོ་ཡང་དེ་བཞིན་དུ། །དེ་ནི་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ཡིན། །
en: “ ‘Similarly, Prince Mahādeva Was Mañjuśrī Kumārabhūta.

source: སྟག་མོར་གྱུར་པ་སྐྱེ་དགུའི་བདག་མོ་ཆེ། །སྟག་ཕྲུག་རྣམས་ནི་དགེ་སློང་ལྔ་པོར་གྱུར། །
en: The tigress was Mahāprajāpatī, And the tiger cubs were the five bhikṣus.

source: དེ་ནས་རྒྱལ་པོ་ཤིང་རྟ་ཆེན་པོ་དང་། །བཙུན་མོ་སྙིང་རྗེ་བར་སྨྲེ་སྔགས་རྣམ་པ་མང་པོ་བཏོན་ནས་རྒྱན་ཐམས་ཅད་བཀྲོལ་ཏེ། །སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དང་ལྷན་ཅིག་ཏུ་བུའི་རུས་པ་ལ་མཆོད་པ་བྱས་ནས།
en: “ ‘Then King Mahāratha and the queen, wailing pitifully many times, removed their jewelry and, together with a great gathering of people, made offerings to the bones of their son.

source: སྙིང་སྟོབས་ཆེན་པོ་དེའི་རུས་པ་འདི་དག་ས་ཕྱོགས་འདི་ཉིད་དུ་བཞག་སྟེ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་མཆོད་རྟེན་འདི་བྱས་སོ། །
en: The bones of Mahāsattva they placed in this area, and they constructed this stūpa of seven precious materials.

source: སྙིང་སྟོབས་ཆེན་པོ་འདིས་སྟག་མོ་ལ་ལུས་ཡོངས་སུ་བཏང་ནས། ལུས་ཡོངས་སུ་བཏང་བ་འདིས་ཕྱི་མ་མ་འོངས་པའི་དུས་ན། བསྐལ་པ་བགྲང་བ་ལས་ཤིན་ཏུ་འདས་པ་རྣམས་སུ་ཡང་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱའོ་ཞེས་སྨོན་ལམ་དེ་སྐད་བཏབ་བོ། །
en: “ ‘This Mahāsattva, having given his body to the tigress, prayed, “Through this gift of my body, may I afterward, in a future time, after countless eons have passed, accomplish the deeds of a buddha for beings.” ’

source: བསྟན་པ་འདི་བཤད་པ་ན་ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུའི་སེམས་ཅན་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: “When this teaching was given, countless, innumerable beings, including humans and devas, developed the aspiration to attain the highest, most complete enlightenment.

source: མཆོད་རྟེན་འདི་འདིར་བསྟན་པའི་རྒྱུ་ནི་འདི་ཡིན་ནོ། །རྐྱེན་ནི་འདི་ཡིན་ནོ། །
en: “This was the cause and condition for the appearance of that stūpa.

source: མཆོད་རྟེན་དེ་ཡང་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་ས་དེ་ཉིད་ཀྱི་ནང་དུ་ཞུགས་སོ། །
en: Then, through the blessing of the Buddha, the stūpa went back down into the ground.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། སྟག་མོ་ལ་ལུས་ཡོངས་སུ་བཏང་བའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་རྩ་དྲུག་པའོ།། །།
en: This concludes “The Gift of the Body to a Tigress,” the twenty-sixth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འབུམ་ཕྲག་དུ་མ་དེ་དག་དེ་བཞིན་གཤེགས་པ་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: Chapter 27: Praise by All Bodhisattvas Then those hundreds of thousands of bodhisattvas went to where the Tathāgata Suvarṇa­ratnākaracchatra­kūṭa was.

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: When they arrived, they bowed down their heads to the feet of the Bhagavat Tathāgata Suvarṇa­ratnākaracchatra­kūṭa and arranged themselves to one side.

source: ཕྱོགས་གཅིག་ཏུ་འཁོད་ནས་ཀྱང་། བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་དེ་དག་གིས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་གསེར་དང་རིན་པོ་ཆེའི་འབྱུང་གནས་གདུགས་བརྩེགས་དེ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །རྒྱལ་བའི་སྐུ་མཆོག་བཙོ་མའི་གསེར་འདྲ་སྟེ། །སྐུ་ལུས་གསེར་གྱི་མདོག་ཏུ་རྣམ་པར་གདའ། །
en: Having arranged themselves to one side, those hundreds of thousands of bodhisattvas placed their palms together and praised the Tathāgata Suvarṇa­ratnākaracchatra­kūṭa with these verses: “The color of the Jina’s body is like refined gold; Your body is completely the color of gold, A golden color like a golden lord of mountains.

source: གསེར་གྱི་རི་དབང་ལྟ་བུར་གསེར་གྱི་མདོག །ཐུབ་པ་པདྨ་དཀར་པོ་གསེར་མདོག་ཅན། །
en: You are a muni, a white lotus, the color of gold.

source: བཟང་པོའི་མཚན་གྱིས་སྐུ་ལུས་རྣམ་པར་བརྒྱན། །དཔེ་བྱད་སྣ་ཚོགས་བཟང་པོས་སྐུ་ལུས་སྤྲས། །
en: “Your body is adorned by the excellent signs; Your body is beautified by the various excellent features.

source: གསེར་གྱི་འོད་ལྟར་མཛེས་པ་རྣམ་པར་འབར། །
en: You are shining with beautiful golden light.

source: ཤིན་ཏུ་དྲི་མེད་ཞི་བ་རི་དབང་འདྲ། །
en: You are stainless and peaceful like the lord of mountains.

source: ཚངས་པའི་སྒྲ་དང་སྒྲ་སྙན་ཚངས་པའི་དབྱངས། །
en: “You have Brahmā’s voice, the beautiful voice of Brahmā.

source: སེང་གེའི་སྒྲ་དང་འབྲུག་སྒྲ་བསྒྲགས་པའི་དབྱངས། །
en: You have the roar of a lion, a voice of resounding thunder.

source: ཡན་ལག་དྲུག་ཅུའི་བསྒྲགས་སྒྲ་དྲི་མེད་སྒྲ། །
en: You have the voice with sixty qualities, a stainless voice.

source: རྒྱལ་དབྱངས་རྨ་བྱ་ཀ་ལ་པིང་ཀའི་སྒྲ། །
en: You have a jina’s voice, the peacock and the kalaviṅka’s sound.

source: ཤིན་ཏུ་དྲི་མེད་དྲི་བྲལ་གཟི་འོད་མཛེས། །
en: “You have completely stainless, immaculate, beautiful, bright light.

source: རྒྱལ་བ་བསོད་ནམས་བརྒྱ་པའི་མཚན་གྱིས་བརྒྱན། །
en: You are a jina adorned by the signs of a hundred qualities.

source: མཁྱེན་པའི་རྒྱ་མཚོ་དྲི་མེད་དྲི་བྲལ་མཆོག །
en: Your ocean of wisdom is stainless, perfectly free of stain.

source: རྒྱལ་བ་ཡོན་ཏན་ཀུན་ལྡན་རི་རབ་འདྲ། །
en: You are a jina like Sumeru, endowed with all qualities.

source: སེམས་ཅན་རྣམས་ལ་ཕན་པར་ཐུགས་བརྩེ་མཆོག །
en: “You have the supreme compassion for benefiting beings.

source: འཇིག་རྟེན་དག་ན་བདེ་བ་སྦྱིན་པའི་མཆོག །
en: You are the supreme bringer of happiness to the worlds.

source: རྒྱལ་བ་དམ་པའི་དོན་རྣམས་སྟོན་པ་སྟེ། །
en: You are a jina who teaches the sublime meaning.

source: མྱ་ངན་འདས་པའི་བདེ་ལ་འཛུད་པ་ལགས། །
en: You are a guide toward the bliss of nirvāṇa.

source: འཆི་བ་མེད་པའི་བདེ་བ་སྩོལ་བ་སྟེ། །རྒྱལ་བའི་བདུད་རྩིའི་ཆོས་ནི་རབ་ཏུ་སྟོན། །འཆི་བ་མེད་པའི་གྲོང་ཁྱེར་འཛུད་པ་སྟེ། །
en: “You bestow the bliss of deathlessness; You are a jina who teaches the Dharma of deathlessness; You are a guide for the city of deathlessness.

source: བདེ་བ་ཀུན་གྱི་འབྱུང་གནས་བདེ་བའི་གནས། །
en: You are the source of all happiness, the basis of happiness.

source: རྒྱལ་བ་འགྲོ་བའི་སྡུག་བསྔལ་ཐར་བར་མཛད། །སྡུག་བསྔལ་རྒྱ་མཚོ་ལས་ནི་སྐྱེ་དགུ་སྒྲོལ། །
en: “You are a jina who frees beings from suffering; You liberate beings from the ocean of suffering.

source: ཞི་བའི་ལམ་ལ་སྐྱེ་དགུ་རབ་ཏུ་འཛུད། །
en: You lead beings on the path to peace.

source: སྐྱེ་དགུ་རྣམས་ལ་བདེ་བ་ཀུན་སྩོལ་བ། །
en: You bestow all happiness upon beings.

source: ཁྱོད་ལ་དཔེ་ནི་བགྱི་བར་མི་ནུས་ཏེ། །
en: “There is no analogy that will serve for you.

source: ཇི་སྙེད་འདྲེན་པའི་ཡེ་ཤེས་ཡོན་ཏན་མཚོ། །
en: You are an ocean of wisdom with the qualities of all guides.

source: སྲོག་ཆགས་ཀུན་ལ་ཁྱོད་ཀྱི་ཐུགས་རྗེ་དང་། །བྱམས་པའི་སྟོབས་དང་ཐབས་དང་བརྩོན་འགྲུས་དང་། །
en: You have the power, methods, and diligence Of compassion and love for all beings.

source: ཁྱོད་ཀྱི་ཡོན་ཏན་ཡེ་ཤེས་རྒྱ་མཚོ་ལས། །བསྐལ་པ་བྱེ་བ་སྟོང་ཕྲག་མང་པོར་ཡང་། །ཡོན་ཏན་ཐིགས་པ་གཅིག་ཙམ་རབ་བསྟན་པར། །ལྷར་བཅས་འགྲོ་བའི་ནང་ན་ནུས་མ་མཆིས། །
en: “There is no one among beings, including devas, Who even in thousands of millions of eons Would be able to teach even one drop of the qualities From your ocean of wisdom and qualities.

source: ཡོན་ཏན་མཚོ་ལས་ཡོན་ཏན་ཐིགས་བླངས་ཏེ། །དེ་ལྟར་བདག་གིས་མདོར་བསྡུས་ཅུང་ཟད་བཤད། །
en: “I have taken a drop of qualities form the ocean of your qualities And in that way have taught a little of it briefly.

source: བདག་གིས་བསོད་ནམས་གང་བསགས་དེ་ཡིས་ནི། །སེམས་ཅན་དེ་དག་བྱང་ཆུབ་མཆོག་རེག་ཤོག །
en: Through whatever merit I have accumulated, May those beings reach the supreme enlightenment.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་བསྟོད་པའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་རྩ་བདུན་པའོ།། །།
en: This concludes “Praise by All Bodhisattvas,” the twenty-seventh chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་མཛེས་པའི་ཏོག་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ། །ཐུབ་དབང་ཁྱོད་ནི་བསོད་ནམས་བརྒྱ་པའི་མཚན། །དཔལ་སྟོང་མཛེས་པའི་ཡོན་ཏན་རྣམས་ཀྱིས་བརྒྱན། །
en: Chapter 28: The Praise of All Tathāgatas Then the bodhisattva Ruciraketu rose from his seat, and, with his upper robe over one shoulder, knelt on his right knee with palms together, bowed toward the Bhagavat, and then praised the Bhagavat with these verses: “Lord of munis, you have the signs of a hundred merits; You are adorned by the qualities of a thousand beautiful splendors.

source: ཁ་དོག་རྒྱ་ཆེན་མཆོག་ཏུ་ཞི་བ་སྟོན། །ཉི་མ་སྟོང་ལྟར་འོད་ནི་རྣམ་པར་འཕྲོ། །
en: You have an exalted color, you manifest supreme peace, And you shine with light like a thousand suns.

source: འོད་ཟེར་དུ་མ་འབར་བའི་འོད་ཀྱིས་ཁྱབ། །ཁ་དོག་སྣ་ཚོགས་གང་བས་རིན་ཆེན་འདྲ། །སྔོན་པོ་དཀར་པོ་གསེར་འོད་བཻ་ཌཱུརྱ། །ཟངས་དང་སྐྱ་རེངས་ཤེལ་གྱི་འོད་ལྟ་བུས། །
en: “You pervade with light by radiating numerous light rays Filled with various colors, so that you resemble a jewel; You have blue, white, golden, and beryl lights, And lights like copper, the dawn, and crystals.

source: རྡོ་རྗེ་རི་དབང་རི་རབ་ཐལ་མཛད་ཅིང་། །ཞིང་རྣམས་བྱེ་བ་དུ་མར་སྣང་མཛད་དེ། །སྡུག་བསྔལ་མི་བཟད་དྲག་པོ་ཞི་བར་མཛད། །བདེ་བའི་མཆོག་གིས་སེམས་ཅན་ཚིམ་པར་མཛད། །
en: “They reach the vajra mountain, lord of mountains, Sumeru, And they illuminate numerous millions of realms, Bringing to an end fierce, terrible suffering, And bringing perfect happiness that satisfies beings.

source: མདོག་དང་དབང་པོ་གསལ་བག་བལྟ་ན་མཛེས། །
en: “You have a bright color and sense organs that are beautiful to behold.

source: གཟུགས་བལྟས་མི་ངོམས་སྐྱེ་བོས་བལྟ་ན་དགའ། །
en: Beings delight to see you and never tire of looking at your body.

source: རྨ་བྱའི་མདོག་འདྲའི་དབུ་སྐྲ་རྣམ་པར་མཛེས། །བུང་པ་མང་པོས་གང་བའི་འོད་དང་འདྲ། །
en: Your hair is so beautiful and has the colors of a peacock, Gleaming as if it were a mass of numerous bees.

source: ཐུགས་རྗེ་རྣམ་དག་ཡོན་ཏན་རྣམས་ཀྱིས་བརྒྱན། །
en: “You are adorned by the qualities of completely pure compassion.

source: ཏིང་འཛིན་བྱམས་པ་བསོད་ནམས་དམ་པ་བསགས། །
en: You have an accumulation of sublime samādhi, love, and merit.

source: དཔེ་བྱད་བཟང་དང་ཁ་དོག་སྣ་ཚོགས་ལྡན། །
en: You are endowed with the various excellent features and colors.

source: ཏིང་འཛིན་བྱང་ཆུབ་ཡན་ལག་ཡོན་ཏན་བརྒྱན། །
en: You are adorned by the qualities of samādhi and enlightenment.

source: ཁྱོད་ནི་རབ་ཏུ་ཚིམ་མཛད་ཕན་པ་མཛད། །བདེ་མཛད་བདེ་བ་ཀུན་གྱི་འབྱུང་གནས་འབྱུང་། །
en: “You bring complete satisfaction and bring benefit; You bring happiness and bring the source of all happiness.

source: ཡོན་ཏན་ཟབ་མོ་སྣ་ཚོགས་རྣམས་ཀྱིས་བརྒྱན། །ཞིང་རྣམས་བྱེ་བ་དག་ཏུ་ལྷང་ངེ་སྟེ། །
en: You are adorned by various profound qualities, And you brighten millions of realms.

source: མེ་ཡི་འོད་ལྟར་འོད་ཟེར་རྣམས་ཀྱིས་མཛེས། །ཇི་ལྟར་ནམ་མཁའ་ཉི་དཀྱིལ་རྫོགས་པ་བཞིན། །
en: “You are beautified by light rays that are like firelight; You are like the complete disk of the sun in the sky.

source: རི་རབ་ལྟ་བུར་ཡོན་ཏན་ཀུན་ལྡན་པར། །འཇིག་རྟེན་ཁམས་རྣམས་ཀུན་ཏུ་རབ་ཏུ་གདའ། །
en: You possess all qualities, like Mount Sumeru, And you appear throughout all world realms.

source: བ་ཞོ་ཀུ་མུ་ད་དང་ཟླ་འདྲ་ཞིང་། །ཁ་བའི་མདོག་དང་དཀར་པོ་བཟང་འདྲ་བའི། །ཚེམས་ཀྱི་ཕྲེང་བས་ཁྱོད་ཀྱི་ཞལ་མཛེས་པ། །ངང་པའི་རྒྱལ་པོ་བར་སྣང་ཇི་བཞིན་ནོ། །
en: “Your face is made beautiful by the rows of your teeth That are like cow curd, white water lilies, and the moon; They have an excellent whiteness, like the color of snow, And resemble the kings of geese in the sky.

source: ཁྱོད་ཀྱི་ཞི་ཞལ་མཚམས་གནས་ཟླ་བ་འདྲ། །གཡས་སུ་འཁྱིལ་ཞིང་ཁོང་ཆུད་འདྲ་བ་ལགས། །
en: “A hair like white beryl curls to the right, Within your peaceful, moon-like face.

source: བཻ་ཌཱུརྱ་འདྲའི་སྐུ་འོད་དཀར་རྣམས་ཀྱིས། །ནམ་མཁའི་དཀྱིལ་ན་ཉི་མ་ལྟ་བུར་མཛེས། །
en: Its white light is as beautiful As the sun in the middle of the sky.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་བསྟོད་པའི་ལེའུ་ཞེས་བྱ་སྟེ་ཉི་ཤུ་རྩ་བརྒྱད་པའོ།། །།དེ་ནས་རིགས་ཀྱི་ལྷ་མོ་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པས།
en: This concludes “Praise of All Tathāgatas,” the twenty-eighth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་བསྟོད་པ། རྣམ་པར་དག་པའི་ཆོས་ལ་སྤོབས་པའི་བློ་མངའ་བ། །ལས་ངན་ལམ་དང་བྲལ་བའི་བདག་ཉིད་བློ་མངའ་ཞིང་། །སྲིད་དང་སྲིད་མིན་མཁྱེན་པ་རྣམ་དག་བློ་མངའ་བ། །སངས་རྒྱས་རྣམ་དག་བློ་མངའ་བ་ལ་ཕྱག་འཚལ་ལོ། །
en: Chapter 29: The Conclusion Then the noble goddess Bodhisattvasamuccayā praised the Bhagavat with these verses: “I pay homage to the Buddha who has pure knowledge, Who has the knowledge with eloquence in the pure Dharma, Who has the knowledge that is free from the path of bad actions, And has the pure knowledge of existence and nonexistence.

source: ཀྱེ་མའོ་ཀྱེ་མའོ་སངས་རྒྱས་གཟི་བརྗིད་མཐའ་ཡས་ཏེ། །
en: “Oh! Oh! The Buddha’s magnificence is infinite! Oh!

source: ཀྱེ་མའོ་ཀྱེ་མའོ་རྒྱ་མཚོ་དང་ནི་རི་རབ་འདྲ། །
en: Oh! He is like the ocean and Mount Sumeru! Oh! Oh!

source: ཀྱེ་མའོ་ཀྱེ་མའོ་སངས་རྒྱས་སྤྱོད་ཡུལ་མཐའ་ཡས་ཏེ། །
en: The Buddha’s activity is infinite!

source: ཨུ་དུམ་བཱ་རའི་མེ་ཏོག་བཞིན་དུ་ཤིན་ཏུ་དཀོན། །
en: He is extremely rare like a fig tree flower!

source: སེམས་ཅན་དག་ནི་ཐམས་ཅད་རྗེས་སུ་གཟུང་སླད་དུ། །གང་གིས་མདོ་སྡེ་དམ་པ་འདི་འདྲ་རབ་གསུངས་པ། །མི་དབང་ཉི་མ་ཤཱཀྱའི་དབང་པོ་རིགས་ཀྱི་ཏོག །
en: “In order that he may care for all beings, He has taught such a sublime sūtra as this.

source: ཀྱེ་མའོ་ཀྱེ་མའོ་དེ་བཞིན་གཤེགས་པ་ཐུགས་རྗེ་ལྡན། །
en: Oh! Oh!

source: དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་དབང་པོ་ཞི། །ཞི་བ་དམ་པ་ཞི་བའི་གྲོང་ཁྱེར་རབ་ཏུ་ཞུགས། །ཏིང་འཛིན་ཟབ་ཅིང་ཞི་ལ་རྡུལ་དང་བྲལ་བ་ནི། །
en: The Tathāgata who has compassion, The lord of humans, the sun, the Śākya family’s crest— “The Tathāgata Śākyamuni is the lord of peace; He resides in sublime peace in the city of peace; His profound samādhi is a peace free of stain.

source: རྒྱལ་བ་སངས་རྒྱས་སྤྱོད་ཡུལ་དེར་ཡང་རབ་ཏུ་ཞུགས། །
en: He has entered the field of activity of the buddhas, the jinas.

source: དེ་ལྟར་ཉན་ཐོས་རྣམས་ཀྱི་ལུས་ནི་སྟོང་པ་སྟེ། །རྐང་གཉིས་དམ་པ་རྣམས་ཀྱི་གནས་པའང་སྟོང་པ་ལགས། །
en: “In that way, the bodies of the disciples are empty; The locations of the supreme among humans are empty.

source: ཆོས་རྣམས་དེ་དག་ཐམས་ཅད་རང་བཞིན་སྟོང་ལགས་ན། །སེམས་ཅན་རྣམས་ནི་སྟོང་པའི་བདག་ཉིད་མ་འཚལ་ཏོ། །
en: All of those phenomena are by nature empty, But beings do not understand that empty nature.

source: རྟག་པར་ཁོར་ཟུག་ཏུ་ནི་རྒྱལ་བ་དྲན་པར་བགྱིད། །རྒྱལ་བ་མཐོང་བར་ཡང་ནི་རྟག་ཏུ་མྱ་ངན་བགྱིད། །
en: “I always, constantly think of the Buddha; I constantly grieve for the sight of the Jina.

source: རྫོགས་པའི་སངས་རྒྱས་ཉི་མ་མཐོང་བར་བགྱི་སླད་དུ། །རྟག་པར་ཡང་ནི་སྨོན་ལམ་རབ་ཏུ་འདེབས་པར་བགྱིད། །
en: I am constantly praying and supplicating In order to see the sun that is the perfect Buddha.

source: བདག་ནི་རྟག་ཏུ་དོག་སར་པུས་མོ་བཙུགས་ནས་སུ། །རྒྱལ་བའི་གཟུགས་ཀྱིས་སྐོམ་པས་རབ་ཏུ་མྱ་ངན་སེམས། །
en: “I constantly kneel in one narrow spot, My mind pained by thirsting for the Jina’s form.

source: འདྲེན་པའི་སླད་དུ་སྙིང་རྗེའི་སྐད་ཀྱིས་ངུ་བར་བགྱིད། །བདག་ནི་བདེ་བར་གཤེགས་པ་མཐོང་བར་རབ་ཏུ་སྐོམ། །
en: I weep and call out pitifully for the Guide, In extreme thirst for the sight of the Tathāgata.

source: མྱ་ངན་མེ་ཡིས་ཀུན་ཏུ་རབ་ཏུ་འབར་བར་འགྱུར། །
en: “I am completely burned by the fire of my grief.

source: མཐོང་བའི་ཆུ་བསིལ་བདག་ལ་རྟག་པར་སྩལ་དུ་གསོལ། །
en: I pray you always give me the cooling water of your sight.

source: བདག་ནི་ཁྱོད་ཀྱི་གཟུགས་ལ་ལྟ་བས་རབ་ཏུ་སྐོམ། །
en: I am in extreme thirst for the sight of your form.

source: ཐུགས་རྗེའི་ཆབ་ཀྱིས་བདག་ལ་རབ་ཏུ་ཚིམ་པར་མཛོད། །
en: Refresh me with the rain of your compassion.

source: འདྲེན་པ་ཁྱོད་ནི་བདག་ལ་ཐུགས་རྗེ་མཛད་དུ་གསོལ། །
en: “I pray that you, the Guide, will be compassionate to me.
